nginx.ab-2019-07-31-1059.log
# for x in {1..9};do date;ab -c${x}00 -t180 -k -s180 localhost/;date;sleep 180;done 2>&1|tee -a $HOME/ab-$(date +%F-%H%M).log
Wed Jul 31 10:59:36 UTC 2019
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Finished 2763 requests


Server Software:        nginx/1.12.2
Server Hostname:        localhost
Server Port:            80

Document Path:          /
Document Length:        36162 bytes

Concurrency Level:      100
Time taken for tests:   180.082 seconds
Complete requests:      2763
Failed requests:        1
   (Connect: 0, Receive: 0, Length: 1, Exceptions: 0)
Non-2xx responses:      1
Keep-Alive requests:    1
Total transferred:      101724501 bytes
HTML transferred:       99911811 bytes
Requests per second:    15.34 [#/sec] (mean)
Time per request:       6517.639 [ms] (mean)
Time per request:       65.176 [ms] (mean, across all concurrent requests)
Transfer rate:          551.64 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   28  67.9      1     676
Processing:   693 6136 6194.1   4323   60042
Waiting:      464 5957 6189.1   4075   60042
Total:        693 6164 6201.0   4379   60042

Percentage of the requests served within a certain time (ms)
  50%   4378
  66%   5811
  75%   7093
  80%   8291
  90%  13067
  95%  18248
  98%  26268
  99%  33069
 100%  60042 (longest request)
Wed Jul 31 11:02:36 UTC 2019
Wed Jul 31 11:05:37 UTC 2019
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Finished 2769 requests


Server Software:        nginx/1.12.2
Server Hostname:        localhost
Server Port:            80

Document Path:          /
Document Length:        36162 bytes

Concurrency Level:      200
Time taken for tests:   180.002 seconds
Complete requests:      2769
Failed requests:        2
   (Connect: 0, Receive: 0, Length: 2, Exceptions: 0)
Non-2xx responses:      2
Keep-Alive requests:    2
Total transferred:      101908936 bytes
HTML transferred:       100092804 bytes
Requests per second:    15.38 [#/sec] (mean)
Time per request:       13001.254 [ms] (mean)
Time per request:       65.006 [ms] (mean, across all concurrent requests)
Transfer rate:          552.88 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   38  54.1     18     400
Processing:   946 12381 6178.9  10174   60201
Waiting:      429 12197 6171.1   9993   60201
Total:        946 12418 6180.2  10225   60257

Percentage of the requests served within a certain time (ms)
  50%  10224
  66%  11782
  75%  13275
  80%  14420
  90%  19423
  95%  24606
  98%  32091
  99%  38538
 100%  60257 (longest request)
Wed Jul 31 11:08:37 UTC 2019
Wed Jul 31 11:11:37 UTC 2019
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Finished 2785 requests


Server Software:        nginx/1.12.2
Server Hostname:        localhost
Server Port:            80

Document Path:          /
Document Length:        36162 bytes

Concurrency Level:      300
Time taken for tests:   180.114 seconds
Complete requests:      2785
Failed requests:        6
   (Connect: 0, Receive: 0, Length: 6, Exceptions: 0)
Non-2xx responses:      6
Keep-Alive requests:    6
Total transferred:      102352132 bytes
HTML transferred:       100527480 bytes
Requests per second:    15.46 [#/sec] (mean)
Time per request:       19401.866 [ms] (mean)
Time per request:       64.673 [ms] (mean, across all concurrent requests)
Transfer rate:          554.94 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   22  48.6      5     509
Processing:   627 18119 6728.6  15943   60326
Waiting:      420 17982 6729.9  15767   60326
Total:        627 18141 6732.9  15980   60352

Percentage of the requests served within a certain time (ms)
  50%  15976
  66%  17745
  75%  19568
  80%  21218
  90%  26569
  95%  31982
  98%  39265
  99%  43405
 100%  60352 (longest request)
Wed Jul 31 11:14:39 UTC 2019
Wed Jul 31 11:17:39 UTC 2019
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Finished 2643 requests


Server Software:        nginx/1.12.2
Server Hostname:        localhost
Server Port:            80

Document Path:          /
Document Length:        36162 bytes

Concurrency Level:      400
Time taken for tests:   180.056 seconds
Complete requests:      2643
Failed requests:        9
   (Connect: 0, Receive: 0, Length: 9, Exceptions: 0)
Non-2xx responses:      9
Keep-Alive requests:    9
Total transferred:      97080237 bytes
HTML transferred:       95348907 bytes
Requests per second:    14.68 [#/sec] (mean)
Time per request:       27250.246 [ms] (mean)
Time per request:       68.126 [ms] (mean, across all concurrent requests)
Transfer rate:          526.53 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   32  60.2     13    1317
Processing:   739 24987 7467.9  23620   60184
Waiting:      431 24827 7471.5  23466   60184
Total:        739 25019 7471.3  23653   60249

Percentage of the requests served within a certain time (ms)
  50%  23652
  66%  25399
  75%  27037
  80%  28428
  90%  32896
  95%  38654
  98%  47077
  99%  52964
 100%  60249 (longest request)
Wed Jul 31 11:20:40 UTC 2019
Wed Jul 31 11:23:40 UTC 2019
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Finished 2750 requests


Server Software:        nginx/1.12.2
Server Hostname:        localhost
Server Port:            80

Document Path:          /
Document Length:        36162 bytes

Concurrency Level:      500
Time taken for tests:   180.028 seconds
Complete requests:      2750
Failed requests:        10
   (Connect: 0, Receive: 0, Length: 10, Exceptions: 0)
Non-2xx responses:      10
Keep-Alive requests:    10
Total transferred:      101032514 bytes
HTML transferred:       99229518 bytes
Requests per second:    15.28 [#/sec] (mean)
Time per request:       32732.371 [ms] (mean)
Time per request:       65.465 [ms] (mean, across all concurrent requests)
Transfer rate:          548.05 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   36  55.9     14     429
Processing:   687 29700 8137.6  29197   60121
Waiting:      432 29533 8139.1  29045   60121
Total:        687 29735 8144.5  29232   60138

Percentage of the requests served within a certain time (ms)
  50%  29232
  66%  30790
  75%  32399
  80%  33652
  90%  38474
  95%  43673
  98%  50647
  99%  54685
 100%  60138 (longest request)
Wed Jul 31 11:26:41 UTC 2019
Wed Jul 31 11:29:41 UTC 2019
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Finished 2720 requests


Server Software:        nginx/1.12.2
Server Hostname:        localhost
Server Port:            80

Document Path:          /
Document Length:        36162 bytes

Concurrency Level:      600
Time taken for tests:   180.122 seconds
Complete requests:      2720
Failed requests:        9
   (Connect: 0, Receive: 0, Length: 9, Exceptions: 0)
Non-2xx responses:      9
Keep-Alive requests:    9
Total transferred:      99951969 bytes
HTML transferred:       98167503 bytes
Requests per second:    15.10 [#/sec] (mean)
Time per request:       39732.890 [ms] (mean)
Time per request:       66.221 [ms] (mean, across all concurrent requests)
Transfer rate:          541.91 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   65 183.0      0    1182
Processing:   673 35347 8869.1  37485   61752
Waiting:      428 34857 8902.2  36978   61752
Total:        673 35412 8880.0  37557   61752

Percentage of the requests served within a certain time (ms)
  50%  37557
  66%  38363
  75%  39146
  80%  39708
  90%  42353
  95%  44710
  98%  48021
  99%  51968
 100%  61752 (longest request)
Wed Jul 31 11:32:43 UTC 2019
Wed Jul 31 11:35:43 UTC 2019
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Finished 2725 requests


Server Software:        nginx/1.12.2
Server Hostname:        localhost
Server Port:            80

Document Path:          /
Document Length:        36162 bytes

Concurrency Level:      700
Time taken for tests:   180.075 seconds
Complete requests:      2725
Failed requests:        70
   (Connect: 0, Receive: 0, Length: 70, Exceptions: 0)
Non-2xx responses:      70
Keep-Alive requests:    70
Total transferred:      98003089 bytes
HTML transferred:       96245477 bytes
Requests per second:    15.13 [#/sec] (mean)
Time per request:       46257.881 [ms] (mean)
Time per request:       66.083 [ms] (mean, across all concurrent requests)
Transfer rate:          531.48 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   37  60.0     18     457
Processing:   866 40274 11398.4  42379   60245
Waiting:      426 40090 11396.1  42157   60245
Total:        866 40312 11406.8  42419   60511

Percentage of the requests served within a certain time (ms)
  50%  42417
  66%  43691
  75%  45108
  80%  46364
  90%  50924
  95%  55987
  98%  60050
  99%  60144
 100%  60511 (longest request)
Wed Jul 31 11:38:46 UTC 2019
Wed Jul 31 11:41:46 UTC 2019
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Finished 2774 requests


Server Software:        nginx/1.12.2
Server Hostname:        localhost
Server Port:            80

Document Path:          /
Document Length:        36162 bytes

Concurrency Level:      800
Time taken for tests:   180.023 seconds
Complete requests:      2774
Failed requests:        166
   (Connect: 0, Receive: 0, Length: 166, Exceptions: 0)
Non-2xx responses:      166
Keep-Alive requests:    166
Total transferred:      96078614 bytes
HTML transferred:       94340874 bytes
Requests per second:    15.41 [#/sec] (mean)
Time per request:       51917.277 [ms] (mean)
Time per request:       64.897 [ms] (mean, across all concurrent requests)
Transfer rate:          521.19 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   27  49.3     15     507
Processing:  1087 44520 12978.7  48198   60293
Waiting:      434 44351 13004.3  47996   60293
Total:       1087 44548 12982.0  48214   60655

Percentage of the requests served within a certain time (ms)
  50%  48214
  66%  49682
  75%  51168
  80%  52228
  90%  56515
  95%  60001
  98%  60099
  99%  60201
 100%  60655 (longest request)
Wed Jul 31 11:44:48 UTC 2019
Wed Jul 31 11:47:48 UTC 2019
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Finished 2790 requests


Server Software:        nginx/1.12.2
Server Hostname:        localhost
Server Port:            80

Document Path:          /
Document Length:        36162 bytes

Concurrency Level:      900
Time taken for tests:   180.046 seconds
Complete requests:      2790
Failed requests:        399
   (Connect: 0, Receive: 0, Length: 399, Exceptions: 0)
Non-2xx responses:      399
Keep-Alive requests:    399
Total transferred:      88235173 bytes
HTML transferred:       86600727 bytes
Requests per second:    15.50 [#/sec] (mean)
Time per request:       58079.224 [ms] (mean)
Time per request:       64.532 [ms] (mean, across all concurrent requests)
Transfer rate:          478.59 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   25  54.7     14     493
Processing:   730 48637 14685.2  54719   61085
Waiting:      439 48470 14694.8  54528   60630
Total:        731 48662 14685.3  54754   61085

Percentage of the requests served within a certain time (ms)
  50%  54754
  66%  56123
  75%  57369
  80%  58358
  90%  60011
  95%  60112
  98%  60286
  99%  60291
 100%  61085 (longest request)
Wed Jul 31 11:50:51 UTC 2019